In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel\parentpoller.py:116: UserWarning: Parent poll failed.  If the frontend dies,
                the kernel may be left running.  Please let us know
                about your system (bitness, Python, etc.) at
                ipython-dev@scipy.org
  ipython-dev@scipy.org""")

In [2]:
#Series是什么 ？
#可以看成是带有索引的数组
s = Series(["a","b","c","d","e","f"])
s

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [3]:
#Series中有两个属性，一个是values，一个是index
s.values

array(['a', 'b', 'c', 'd', 'e', 'f'], dtype=object)

In [5]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [7]:
s = Series(np.arange(5), index=["a","b","c","d","e"])
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [8]:
s["a"]

0

In [10]:
s[["a","d","e"]] = [34,56,34]

In [11]:
s

a    34
b     1
c     2
d    56
e    34
dtype: int32

In [12]:
s>20#同样可以使用布尔索引

a     True
b    False
c    False
d     True
e     True
dtype: bool

In [13]:
s[s>20]

a    34
d    56
e    34
dtype: int32

In [14]:
s * 2 #同样可以对Series中的元素进行运算

a     68
b      2
c      4
d    112
e     68
dtype: int32

In [15]:
data = {"Beijing":90000, "Shanghai":85000, "Shenzhen":85000}
s = Series(data)

In [16]:
s

Beijing     90000
Shanghai    85000
Shenzhen    85000
dtype: int64

In [17]:
s = Series(data, index=["Beijing","Shanghai","Hangzhou"])
s

Beijing     90000.0
Shanghai    85000.0
Hangzhou        NaN
dtype: float64

In [18]:
pd.isnull(s) #判断Series中的哪些内容是空值

Beijing     False
Shanghai    False
Hangzhou     True
dtype: bool

In [19]:
s[pd.isnull(s)] = 0

In [20]:
s

Beijing     90000.0
Shanghai    85000.0
Hangzhou        0.0
dtype: float64

In [21]:
data1 = {"Beijing":90000, "Shanghai":85000, "Shenzhen":85000}
data2 = {"Beijing":85000, "Shanghai":90000, "Shenzhen":75000}
s1 = Series(data1)
s2 = Series(data2)

In [22]:
s1

Beijing     90000
Shanghai    85000
Shenzhen    85000
dtype: int64

In [23]:
s2

Beijing     85000
Shanghai    90000
Shenzhen    75000
dtype: int64

In [24]:
s1 + s2

Beijing     175000
Shanghai    175000
Shenzhen    160000
dtype: int64

In [26]:
data3 = {"Beijing":90000, "Shanghai":85000, "Hangzhou":85000}
s3 = Series(data3)
s3

Beijing     90000
Shanghai    85000
Hangzhou    85000
dtype: int64

In [27]:
s2 + s3

Beijing     175000.0
Hangzhou         NaN
Shanghai    175000.0
Shenzhen         NaN
dtype: float64

In [29]:
#DataFrame,其实就是二维表
data = {"city":["北京","北京","武汉","武汉","深圳","乌鲁木齐"],
       "year":[2017,2018,2017,2018,2018,2018],
       "price":[90000,100000,20000,25000,95000,10000]}
df = DataFrame(data)
df

   city  year   price
0    北京  2017   90000
1    北京  2018  100000
2    武汉  2017   20000
3    武汉  2018   25000
4    深圳  2018   95000
5  乌鲁木齐  2018   10000

In [33]:
df = DataFrame(data, columns=["city","year","price","suibian"])
df

   city  year   price suibian
0    北京  2017   90000     NaN
1    北京  2018  100000     NaN
2    武汉  2017   20000     NaN
3    武汉  2018   25000     NaN
4    深圳  2018   95000     NaN
5  乌鲁木齐  2018   10000     NaN

In [34]:
#通过索引，可以获取某列的值
df["city"]

0      北京
1      北京
2      武汉
3      武汉
4      深圳
5    乌鲁木齐
Name: city, dtype: object

In [35]:
df[["city","year"]]

   city  year
0    北京  2017
1    北京  2018
2    武汉  2017
3    武汉  2018
4    深圳  2018
5  乌鲁木齐  2018

In [36]:
df["suibian"] = 1
df

   city  year   price  suibian
0    北京  2017   90000        1
1    北京  2018  100000        1
2    武汉  2017   20000        1
3    武汉  2018   25000        1
4    深圳  2018   95000        1
5  乌鲁木齐  2018   10000        1

In [37]:
df["suibian"] = [3,4,54,32,23,2]
df

   city  year   price  suibian
0    北京  2017   90000        3
1    北京  2018  100000        4
2    武汉  2017   20000       54
3    武汉  2018   25000       32
4    深圳  2018   95000       23
5  乌鲁木齐  2018   10000        2

In [38]:
df["suibian"] = np.arange(6)

In [39]:
df

   city  year   price  suibian
0    北京  2017   90000        0
1    北京  2018  100000        1
2    武汉  2017   20000        2
3    武汉  2018   25000        3
4    深圳  2018   95000        4
5  乌鲁木齐  2018   10000        5

In [40]:
df.ix[0]#获取第0行的内容

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

city          北京
year        2017
price      90000
suibian        0
Name: 0, dtype: object

In [41]:
df.ix[[0,1]] #获取第0行和第1行的内容

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

  city  year   price  suibian
0   北京  2017   90000        0
1   北京  2018  100000        1

In [42]:
df.ix[[0,1],["city","year","price"]]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

  city  year   price
0   北京  2017   90000
1   北京  2018  100000

In [44]:
df.ix[0:3,0:2] #0:3切行  0:2切列

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

  city  year
0   北京  2017
1   北京  2018
2   武汉  2017
3   武汉  2018

In [2]:
path = "orders.tsv"
df = pd.read_csv(path, sep="\t")
df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
14,7,1,Chips and Guacamole,NaN,$4.45
15,8,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
16,8,1,Chicken Burrito,"[Tomatillo-Green Chili Salsa (Medium), [Pinto ...",$8.49
17,9,1,Chicken Burrito,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice...",$8.49
18,9,2,Canned Soda,[Sprite],$2.18
19,10,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$8.75
20,10,1,Chips and Guacamole,NaN,$4.45
21,11,1,Barbacoa Burrito,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$8.99
22,11,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
23,12,1,Chicken Burrito,"[[Tomatillo-Green Chili Salsa (Medium), Tomati...",$10.98
24,12,1,Izze,[Grapefruit],$3.39
25,13,1,Chips and Fresh Tomato Salsa,NaN,$2.39
26,13,1,Chicken Bowl,"[Roasted Chili Corn Salsa (Medium), [Pinto Bea...",$8.49
27,14,1,Carnitas Burrito,"[[Tomatillo-Green Chili Salsa (Medium), Roaste...",$8.99
28,14,1,Canned Soda,[Dr. Pepper],$1.09
29,15,1,Chicken Burrito,"[Tomatillo-Green Chili Salsa (Medium), [Pinto ...",$8.49
...,...,...,...,...,...
4592,1825,1,Barbacoa Burrito,"[Tomatillo Red Chili Salsa, [Rice, Fajita Vege...",$11.75
4593,1825,1,Carnitas Bowl,"[Roasted Chili Corn Salsa, [Rice, Sour Cream, ...",$11.75
4594,1825,1,Barbacoa Bowl,"[Roasted Chili Corn Salsa, [Pinto Beans, Sour ...",$11.75
4595,1826,1,Chicken Bowl,"[Tomatillo Green Chili Salsa, [Rice, Black Bea...",$8.75
4596,1826,1,Chips and Guacamole,NaN,$4.45
4597,1826,1,Canned Soft Drink,[Nestea],$1.25
4598,1826,1,Bottled Water,NaN,$1.50
4599,1827,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Cheese, Lettuce]]",$8.75
4600,1827,1,Chips and Guacamole,NaN,$4.45
4601,1827,1,Canned Soft Drink,[Diet Coke],$1.25
4602,1827,1,Barbacoa Burrito,[Tomatillo Green Chili Salsa],$9.25
4603,1827,1,Barbacoa Burrito,[Tomatillo Green Chili Salsa],$9.25
4604,1828,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$8.75
4605,1828,1,Chips and Guacamole,NaN,$4.45
4606,1828,1,Canned Soft Drink,[Coke],$1.25
4607,1829,1,Steak Burrito,"[Tomatillo Green Chili Salsa, [Rice, Cheese, S...",$11.75
4608,1829,1,Veggie Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.25
4609,1829,1,Canned Soft Drink,[Sprite],$1.25
4610,1830,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4611,1830,1,Veggie Burrito,"[Tomatillo Green Chili Salsa, [Rice, Fajita Ve...",$11.25
4612,1831,1,Carnitas Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$9.25
4613,1831,1,Chips,NaN,$2.15
4614,1831,1,Bottled Water,NaN,$1.50
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4616,1832,1,Chips and Guacamole,NaN,$4.45
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [47]:
df.shape

(4622, 5)

In [49]:
#表中有多少条记录？
df.shape[0]

4622

In [50]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null object
dtypes: int64(2), object(3)
memory usage: 180.6+ KB

In [52]:
df.head()#默认返回当前DataFrame中的前5条记录

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [53]:
df.head(10) #返回当前DataFrame中的前10条记录

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25